// Функция ymaps.ready() будет вызвана, когда
// загрузятся все компоненты API, а также когда будет готово DOM-дерево.
const initMap = () => {
  ymaps.ready(init);
  function init() {
    // Создание карты.
    const myMap = new ymaps.Map('map', {
      // Координаты центра карты.
      // Порядок по умолчанию: «широта, долгота».
      // Чтобы не определять координаты центра карты вручную,
      // воспользуйтесь инструментом Определение координат.
      center: [59.938635, 30.323118],
      // Уровень масштабирования. Допустимые значения:
      // от 0 (весь мир) до 19.
      zoom: 16,
    });
    myMap.controls.add('zoomControl', {
      float: 'none',
      position: {
        right: 40,
        top: 5,
      },
    });
    myMap.behaviors.enable('scrollZoom');
    myMap.copyrights.add('© Семён Крекотун');
    myMap.balloon.open(myMap.getCenter(), {
      contentHeader: 'Круизы в Антарктику ',
      contentBody: 'Волшебный мир айсбергов и пингвинов' +
      '<svg xmlns="http://www.w3.org/2000/svg" fill="none" width="10" height="10" viewBox="0 0 18 18"><path fill="#011C40" d="M18 13.42v3.54a1 1 0 0 1-.93 1c-.44.02-.8.04-1.07.04A16 16 0 0 1 .05.93a1 1 0 0 1 1-.93h3.53a.5.5 0 0 1 .5.45A13.52 13.52 0 0 0 6.35 5c.1.2.03.44-.15.57L4.04 7.11a13.05 13.05 0 0 0 6.85 6.85l1.54-2.16a.46.46 0 0 1 .57-.15 13.9 13.9 0 0 0 4.55 1.27.5.5 0 0 1 .45.5Z"/></svg> <a href="tel:+78002000000">8-800-200-00-00</a>' +
      '<address><svg xmlns="http://www.w3.org/2000/svg" fill="none" width="10" height="10" viewBox="0 0 18 22"><path fill="#011C40" d="M15.364 15.556 9 22l-6.364-6.444a9.149 9.149 0 0 1-2.463-4.665 9.219 9.219 0 0 1 .512-5.266A9.09 9.09 0 0 1 4 1.535 8.921 8.921 0 0 1 9 0c1.78 0 3.52.534 5 1.536a9.089 9.089 0 0 1 3.315 4.09 9.22 9.22 0 0 1 .512 5.264 9.149 9.149 0 0 1-2.463 4.666ZM9 11.138c.53 0 1.04-.214 1.414-.594a2.038 2.038 0 0 0 0-2.864A1.988 1.988 0 0 0 9 7.089c-.53 0-1.04.213-1.414.593C7.21 8.06 7 8.576 7 9.113c0 .537.21 1.052.586 1.431.375.38.884.594 1.414.594Z"/></svg>г. Санкт Петербург, ул.&nbsp;Большая&nbsp;Конюшенная, 19/8</address>',
    });
    myMap.hint.open([59.938635, 30.323118], `Забронируйте тур за 3 6 месяцев до даты выезда и сэкономьте до 50%`);
    const placemark = new YMaps.Placemark(new YMaps.GeoPoint(59.938635, 30.323118));
    myMap.addOverlay(placemark);
  }
};

export {initMap};
